const str = `
                    一、判断题
                   1、可以将家庭无线路由器理解为单纯性无线AP（无线访问点）与宽带路由器的“结合体”。(2.0分) A:  正确B:  错误 AB    解答答案 :
                          
                            A 
                           解析 : 略
                    一、判断题
                   2、在网卡出厂时会被赋予一个MAC地址，但手机没有MAC地址，所以MAC地址过滤仅仅适用于电脑。(2.0分) A:  正确B:  错误 AB    解答答案 :
                          
                            B 
                           解析 : 略
                    一、判断题
                   3、公共场所使用微信认证上网，不会泄露个人信息。(2.0分) A:  正确B:  错误 AB    解答答案 :
                          
                            B 
                           解析 : 略
                    一、判断题
                   4、一般，家庭路由器上有设置DNS地址项，我们可以随意更改这个DNS地址。(2.0分) A:  正确B:  错误 AB    解答答案 :
                          
                            B 
                           解析 : 略
                    一、判断题
                   5、《禁止非法生产销售使用窃听窃照专用器材和伪基站设备的规定》第五条规定：本规定所称伪基站设备，是指未取得电信设备进网许可和无线电发射设备型号核准，具有搜取手机用户信息，强行向不特定用户手机发送短信息等功能，使用过程中会非法占用公众移动通信频率，局部阻断公众移动通信网络信号，经公安机关依法认定的非法无线电通信设备。(2.0分) A:  正确B:  错误 AB    解答答案 :
                          
                            A 
                           解析 : 略
                    一、判断题
                   6、被伪基站信号覆盖的所有手机都会长时间脱网，不能接打电话，并被强制接收伪基站发出的短信。(2.0分) A:  正确B:  错误 AB    解答答案 :
                          
                            B 
                           解析 : 略
                    一、判断题
                   7、能发送短信的基站设备就是伪基站设备。(2.0分) A:  正确B:  错误 AB    解答答案 :
                          
                            B 
                           解析 : 略
                    一、判断题
                   8、《中华人民共和国网络安全法》自2017年6月1日起施行。(2.0分) A:  正确B:  错误 AB    解答答案 :
                          
                            A 
                           解析 : 略
                    一、判断题
                   9、可以到手机论坛或者小型手机应用市场下载APP。(2.0分) A:  正确B:  错误 AB    解答答案 :
                          
                            B 
                           解析 : 略
                    一、判断题
                   10、有些安卓手机病毒，用杀毒软件是无法直接杀除的。(2.0分) A:  正确B:  错误 AB    解答答案 :
                          
                            A 
                           解析 : 略
                    一、判断题
                   11、苹果手机的越狱是十分危险的行为，这一行为会破坏苹果手机的安全机制。(2.0分) A:  正确B:  错误 AB    解答答案 :
                          
                            A 
                           解析 : 略
                    一、判断题
                   12、对于安卓手机，可能存在一些杀毒软件无法清除的病毒，可以通过ROOT后，授予专杀工具root权限，对病毒进行清除。(2.0分) A:  正确B:  错误 AB    解答答案 :
                          
                            A 
                           解析 : 略
                    一、判断题
                   13、删除手机上所有数据，后期不能进行定位追踪。(2.0分) A:  正确B:  错误 AB    解答答案 :
                          
                            A 
                           解析 : 略
                    一、判断题
                   14、一维条码和二维码的共同点是两者在水平和垂直都携带信息。(2.0分) A:  正确B:  错误 AB    解答答案 :
                          
                            B 
                           解析 : 略
                    一、判断题
                   15、可以直接将病毒粘贴至二维码生成器中，使得生成的二维码自身带毒。(2.0分) A:  正确B:  错误 AB    解答答案 :
                          
                            B 
                           解析 : 略
                    二、多选题
                   15、防范支招环节，最重要的是哪几招？(2.0分)  A:  设置MAC地址过滤B:  修改路由器默认管理IP地址及账号C:  将无线路由器的认证设置为WPA-PSK/WPA2-PSK模式D:  通过关闭路由器QSS功能 ABCD   解答答案 :
                          
                            A 
                          
                            B 
                          
                            C 
                           解析 : 略
                    二、多选题
                   17、常用的公共Wi-Fi接入认证方式有哪些？(2.0分)  A:  第三方数据源认证B:  密码认证C:  微信认证D:  短信认证 ABCD   解答答案 :
                          
                            A 
                          
                            B 
                          
                            C 
                          
                            D 
                           解析 : 略
                    二、多选题
                   18、在公共Wi-Fi时，以下哪些建议合理？(2.0分)  A:  上网认证时，让提供过多的个人信息也无妨B:  没有密码的Wi-Fi绝对不要用。C:  少用“密码认证”的Wi-FiD:  使用Wi-Fi时不用有太多顾虑，能蹭则蹭，没啥危害。 ABCD   解答答案 :
                          
                            B 
                          
                            C 
                           解析 : 略
                    二、多选题
                   19、实际上，只要使用了公共Wi-Fi，就会面临如下潜在威胁。(2.0分)  A:  终端设备信息被扫描。B:  上网数据甚至被篡改。C:  上网数据被监视、被劫持。D:  设备存储数据泄露。 ABCD   解答答案 :
                          
                            A 
                          
                            B 
                          
                            C 
                          
                            D 
                           解析 : 略
                    二、多选题
                   20、关于DNS服务器描述正确的是___。(2.0分)  A:  DNS是上网时必须用到的。B:  DNS都是合法的C:  DNS是上网的翻译D:  将域名转化为IP ABCD   解答答案 :
                          
                            A 
                          
                            C 
                          
                            D 
                           解析 : 略
                    二、多选题
                   21、伪基站设备一般包括（ ）(2.0分)  A:  主机B:  电脑C:  发送器和电源D:  手机 ABCD   解答答案 :
                          
                            A 
                          
                            B 
                          
                            C 
                           解析 : 略
                    二、多选题
                   22、伪基站发送的信息有哪些类型？(2.0分)  A:  黄赌毒、假发票、办证短信B:  普通垃圾短信C:  反国家短信D:  诈骗短信 ABCD   解答答案 :
                          
                            A 
                          
                            B 
                          
                            C 
                          
                            D 
                           解析 : 略
                    二、多选题
                   23、有哪类企业能够利用他们的技术优势追踪伪基站？(2.0分)  A:  移动运营企业B:  互联网企业C:  广播电视企业D:  网络安全企业 ABCD   解答答案 :
                          
                            A 
                          
                            B 
                           解析 : 略
                    二、多选题
                   24、伪基站的诈骗短信一般有以下几种形式?(2.0分)  A:  中奖信息B:  要求转账、汇款之类（如房东、领导）C:  校园信息D:  积分兑换 ABCD   解答答案 :
                          
                            A 
                          
                            B 
                          
                            C 
                          
                            D 
                           解析 : 略
                    二、多选题
                   25、有伪基站出现时，我们的手机会有哪些现象？(2.0分)  A:  接收到垃圾短信B:  使手机屏幕碎裂C:  短时脱网D:  接收到诈骗短信 ABCD   解答答案 :
                          
                            A 
                          
                            C 
                          
                            D 
                           解析 : 略
                    二、多选题
                   26、造成Android手机病毒多的原因是(2.0分)  A:  对于开发者没有限定，任何人都可以编写APP并发布B:  安卓系统采用了linux系统内核，所以才造成病毒泛滥C:  除了谷歌商店外，大量的应用市场并没有严格的APP审核机制D:  手机厂商可以随意修改系统，造成系统碎片化严重 ABCD   解答答案 :
                          
                            A 
                          
                            C 
                          
                            D 
                           解析 : 略
                    二、多选题
                   27、手机病毒的危害有哪些(2.0分)  A:  黑客会远程控制我们的手机B:  盗取手机中的通信录、短信、各种账号和密码等个人信息C:  恶意推送广告，消耗资费D:  自动发送短信、拨打电话、连接网络产生流量，严重消耗资费 ABCD   解答答案 :
                          
                            A 
                          
                            B 
                          
                            C 
                          
                            D 
                           解析 : 略
                    二、多选题
                   28、当出现以下哪些状况，我们可以初步判断手机有可能中毒(2.0分)  A:  手机流量无故突然增多B:  手机经常无理由的死机、自动重启、黑屏、运行缓慢等C:  手机话费突然增多D:  手机中不知道什么时候偷偷安装了APP ABCD   解答答案 :
                          
                            A 
                          
                            B 
                          
                            C 
                          
                            D 
                           解析 : 略
                    二、多选题
                   29、一些不法分子通过企业证书开发含有恶意程序的APP，苹果手机用户安装这些APP后就会中毒，下列哪些方法可以清除这样的APP(2.0分)  A:  点击APP图标直接删除B:  通过删除证书的方式进行彻底删除C:  以上都不对D:  恢复出厂设置 ABCD   解答答案 :
                          
                            A 
                          
                            B 
                           解析 : 略
                    二、多选题
                   30、因手机丢失而引发的风险包括__________。(2.0分)  A:  个人隐私泄露B:  社交、金融账号被盗C:  机主、联系人遭诈骗D:  办公机密泄露 ABCD   解答答案 :
                          
                            A 
                          
                            B 
                          
                            C 
                          
                            D 
                           解析 : 略
                    三、单选题
                   31、出于成本和安全的考虑，家庭路由器应选择以下哪种认证类型？(2.0分) A:  WPA/WPA2B:  WEP2C:  WPA-PSK/WPA2-PSKD:  WEP ABCD    解答答案 :
                          
                            C 
                           解析 : 略
                    三、单选题
                   32、关于路由器固件描述正确的是____。(2.0分) A:  不同品牌的路由器，固件可以通用。B:  路由器厂商不会发布新固件。C:  可以将路由器固件理解为路由器的操作系统。D:  没有必要更新固件。 ABCD    解答答案 :
                          
                            C 
                           解析 : 略
                    三、单选题
                   33、小张的手机已经使用三个月了，存储了很多照片和他喜欢的各种软件，但从来没有做过手机备份，你建议他近期做一次________备份，保证手机数据的安全。(2.0分) A:  系统B:  应用程序C:  完整D:  部分 ABCD    解答答案 :
                          
                            C 
                           解析 : 略
                    三、单选题
                   34、下列特点中，不属于NFC的是？(2.0分) A:  连接距离远B:  带宽高、低能耗C:  没电也能用D:  建立连接快 ABCD    解答答案 :
                          
                            A 
                           解析 : 略
                    三、单选题
                   35、对网关欺骗攻击理解正确的是__(2.0分) A:  网关欺骗是指黑客冒充网关，从而截获用户数据。B:  终端能够鉴别出真假网关C:  网关欺骗的目标是让用户无法上网。D:  网关欺骗不属于中间人攻击 ABCD    解答答案 :
                          
                            A 
                           解析 : 略
                    三、单选题
                   36、钓鱼攻击可能通过___实现的。(2.0分) A:  攻击电脑。B:  盗用上网账号C:  篡改路由器DNS地址。D:  破解银行账号。 ABCD    解答答案 :
                          
                            C 
                           解析 : 略
                    三、单选题
                   37、关于胖AP和瘦AP描述错误的是__。(2.0分) A:  胖AP仅仅用于家庭，瘦AP仅用于公共场所B:  瘦AP能够解决用户漫游问题C:  胖AP具有较好的独立性。D:  胖AP和瘦AP是无线局域网的两种基本构架。 ABCD    解答答案 :
                          
                            A 
                           解析 : 略
                    三、单选题
                   38、短信认证上网容易暴露哪些信息？(2.0分) A:  手机号B:  手机MAC地址C:  我的消费习惯D:  微信号 ABCD    解答答案 :
                          
                            A 
                           解析 : 略
                    三、单选题
                   39、对网关欺骗攻击理解正确的是__(2.0分) A:  网关欺骗是指黑客冒充网关，从而截获用户数据B:  网关欺骗不属于中间人攻击C:  终端能够鉴别出真假网关D:  网关欺骗的目标是让用户无法上网。 ABCD    解答答案 :
                          
                            A 
                           解析 : 略
                    三、单选题
                   40、对钓鱼Wi-Fi的描述不正确的是__(2.0分) A:  钓鱼Wi-Fi经常假冒假冒一些连锁商业机构的Wi-FiB:  Wi-Fi的名称不会被冒充C:  还会使用一些看上去很美好、很有诱惑的名称D:  钓鱼Wi-Fi经常假冒这三大运营商的Wi-Fi ABCD    解答答案 :
                          
                            B 
                           解析 : 略
                    三、单选题
                   41、基站的作用概括起来有以下三点：1）____________，2）可以转发短信和语音信号，3）主动发送短信息。(2.0分) A:  可以获取其覆盖范围内的手机信息B:  可以给其覆盖范围内的所有手机充电C:  为手机提供上网服务D:  可以存储其覆盖范围内的所有手机信息 ABCD    解答答案 :
                          
                            A 
                           解析 : 略
                    三、单选题
                   42、伪基站一般由什么设备组成?(2.0分) A:  天线和主机B:  主机、笔记本电脑、发送器C:  假的基站设备D:  可入侵基站的电脑和黑客软件 ABCD    解答答案 :
                          
                            B 
                           解析 : 略
                    三、单选题
                   43、伪基站发送的信息可以分为3类：普通垃圾短信、_________、诈骗短信。(2.0分) A:  公众通知短信B:  黄赌毒及反国家短信C:  祝福短信D:  道歉短信 ABCD    解答答案 :
                          
                            B 
                           解析 : 略
                    三、单选题
                   44、伪基站发送诈骗短信主要特点：是以单向、_________ 、获取非法收益(2.0分) A:  发送涉黄涉赌信息B:  发送钓鱼网站链接C:  小批量发送D:  超大量地发送 ABCD    解答答案 :
                          
                            D 
                           解析 : 略
                    三、单选题
                   45、伪基站具有哪些特点？(2.0分) A:  发现难、单向性、成本低B:  发现难、范围广、成本低C:  发现难、范围小、成本高D:  治理易、范围小、成本低 ABCD    解答答案 :
                          
                            A 
                           解析 : 略
                    三、单选题
                   46、除国家和运营商采取有效措施遏制伪基站的诈骗行为外，个人也要加强对自己信息安全的保护。一旦发现伪基站信息或已经受骗，可立即向公安机关、猎网平台、运营商客服、_________网络不良和垃圾信息举报中心举报。(2.0分) A:  120B:  12114C:  12345D:  12321 ABCD    解答答案 :
                          
                            D 
                           解析 : 略
                    三、单选题
                   47、基站的基本功能是什么？(2.0分) A:  接收和储存信息B:  接收和转发信息C:  接收和管理信息D:  单纯转发信息，不进行存储和管理。 ABCD    解答答案 :
                          
                            B 
                           解析 : 略
                    三、单选题
                   48、Android手机的软件格式正确的是(2.0分) A:  安卓市场.exeB:  安卓市场.apkC:  安卓市场.msiD:  安卓市场.ipa ABCD    解答答案 :
                          
                            B 
                           解析 : 略
                    三、单选题
                   49、以下那种是Android手机病毒主要的转播方式(2.0分) A:  通过刷机包传播B:  通过短信链接传播C:  通过包含恶意网址的二维码传播D:  以上都是 ABCD    解答答案 :
                          
                            D 
                           解析 : 略
                    三、单选题
                   50、一般情况下，苹果手机安装的杀毒软件并没有病毒查杀功能，这是为什么？(2.0分) A:  由于苹果手机系统“沙箱”安全机制的限制，每个软件只能在自己的区域活动，因此即使有杀毒功能也不能扫描其他空间，因此苹果手机上的杀毒软件都没有杀毒功能。B:  苹果公司的应用商店不允许软件有杀毒功能C:  苹果手机不需要杀毒软件D:  以上都不对 ABCD    解答答案 :
                          
                            A 
                           解析 : 略 上一题 下一题 答题卡
                      
                    `;

const regex = /(\d+)、[\s\S]*?\n\s*([A-D](?:\s*[A-D])*)\s*\n/g;
const matches = [...str.matchAll(regex)];

// 提取题号和答案
const result = matches.map((match) => ({
  题号: match[1],
  答案: match[2].trim().split(/\s+/), // 使用空格分割答案
}));

for (let i = 0; i < result.length; i += 5) {
  console.log(
    result
      .slice(i, i + 5)
      .map((item) => `${item["题号"]}： ${item["答案"].join("、")}`)
      .join("\n")
  );
  console.log("----------------------------"); // 分隔线
}

// const regex = /(\d+)、[\s\S]*?\n\s*([A-D])\s*\n/g;

// const matches = [...str.matchAll(regex)];
// console.log("🚀 liu123 ~ matches:", matches);

// // 提取题号和答案
// const result = matches.map((match) => {
//   // 提取答案，去掉多余的空白并将多个答案用逗号分隔
//   const answers = match[2].replace(/\s*[,，]\s*/g, ",");
//   //   console.log("🚀 liu123 ~ answers:", answers);
//   return `题号: ${match[1]}, 答案: ${answers}`;
// });

// // 将结果分为每 5 个一组
// for (let i = 0; i < result.length; i += 5) {
//   console.log(result.slice(i, i + 5).join("\n"));
//   console.log("----------------------------"); // 分隔线
// }
